tests/unit/api_contract/_api_checker/test_payments/payment_plan.fixture.json

{
    "payment_plan": {
        "master": {
            "model": "payment.paymentplan",
            "pk": "d7e4a15f-8475-42cb-9715-1fb4c0c368c3",
            "fields": {
                "is_removed": false,
                "created_at": "2025-01-01T00:00:00Z",
                "updated_at": "2025-01-01T00:00:00Z",
                "version": 1735688653315201,
                "unicef_id": "PP-BA0000-25-00000001",
                "internal_data": {},
                "business_area": "a07066d4-4ca6-43a7-8858-650c00bf7017",
                "program_cycle": "c3077603-9987-4024-81cb-50e65722222f",
                "payment_plan_group": "51268f9c-49fe-40ef-9b96-ca2da1aed792",
                "delivery_mechanism": null,
                "financial_service_provider": null,
                "imported_file": null,
                "export_file_entitlement": null,
                "export_file_delivery": null,
                "export_pdf_file_summary": null,
                "reconciliation_import_file": null,
                "steficon_rule": null,
                "steficon_rule_targeting": null,
                "created_by": "e5c8c87f-aac7-4ada-8050-9e83a4da29d8",
                "closed_by": null,
                "closure_comment": null,
                "source_payment_plan": null,
                "follow_up_instruction": null,
                "storage_file": null,
                "name": null,
                "start_date": null,
                "end_date": null,
                "currency": null,
                "dispersion_start_date": "2025-01-01",
                "dispersion_end_date": "2025-01-31",
                "excluded_ids": null,
                "exclusion_reason": null,
                "vulnerability_score_min": null,
                "vulnerability_score_max": null,
                "abort_comment": "",
                "flat_amount_value": null,
                "status": "OPEN",
                "background_action_status": null,
                "build_status": null,
                "built_at": null,
                "exchange_rate": null,
                "custom_exchange_rate": false,
                "use_payment_gateway": false,
                "custom_exchange_rate_set_by": null,
                "female_children_count": 0,
                "male_children_count": 0,
                "female_adults_count": 0,
                "male_adults_count": 0,
                "total_households_count": 0,
                "total_individuals_count": 0,
                "imported_file_date": null,
                "total_entitled_quantity": null,
                "total_entitled_quantity_usd": null,
                "total_entitled_quantity_revised": null,
                "total_entitled_quantity_revised_usd": null,
                "total_delivered_quantity": null,
                "total_delivered_quantity_usd": null,
                "total_undelivered_quantity": null,
                "total_undelivered_quantity_usd": null,
                "steficon_targeting_applied_date": null,
                "steficon_applied_date": null,
                "plan_type": "REGULAR",
                "export_tag": null,
                "exclude_household_error": null,
                "status_date": "2025-01-01T00:00:00Z",
                "is_cash_assist": false,
                "flag_exclude_if_active_adjudication_ticket": false,
                "flag_exclude_if_on_sanction_list": false,
                "payment_plan_purposes": [
                    "36fccf08-a662-4535-86c5-3b5fb5b06cf2"
                ]
            }
        },
        "deps": [
            {
                "model": "core.businessarea",
                "pk": "a07066d4-4ca6-43a7-8858-650c00bf7017",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "code": "BA0000",
                    "slug": "business-area-0",
                    "name": "Business Area 0",
                    "long_name": "Business Area 0 Long Name",
                    "parent": null,
                    "office_country": null,
                    "is_split": false,
                    "region_code": "64",
                    "region_name": "TEST",
                    "has_data_sharing_agreement": false,
                    "is_accountability_applicable": false,
                    "rdi_import_xlsx_disabled": false,
                    "active": true,
                    "enable_email_notification": true,
                    "kobo_username": null,
                    "kobo_token": null,
                    "kobo_url": null,
                    "rapid_pro_host": null,
                    "rapid_pro_payment_verification_token": null,
                    "rapid_pro_messages_token": null,
                    "rapid_pro_survey_token": null,
                    "postpone_deduplication": false,
                    "ingest_source": "ALL_EXCEPT_COUNTRY_WORKSPACE",
                    "deduplication_duplicate_score": 6.0,
                    "deduplication_possible_duplicate_score": 6.0,
                    "deduplication_batch_duplicates_percentage": 50,
                    "deduplication_batch_duplicates_allowed": 5,
                    "deduplication_golden_record_duplicates_percentage": 50,
                    "deduplication_golden_record_duplicates_allowed": 5,
                    "deduplication_ignore_withdraw": false,
                    "biometric_deduplication_threshold": 0.0,
                    "custom_fields": {},
                    "countries": [],
                    "payment_countries": []
                }
            },
            {
                "model": "program.programcycle",
                "pk": "c3077603-9987-4024-81cb-50e65722222f",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315200,
                    "unicef_id": "PC-BA0000-25-000001",
                    "title": "Programme Cycle 0",
                    "program": "c5303043-0343-499d-a2b7-e844b7655f88",
                    "status": "ACTIVE",
                    "start_date": "2025-01-01",
                    "end_date": null,
                    "created_by": null
                }
            },
            {
                "model": "program.program",
                "pk": "c5303043-0343-499d-a2b7-e844b7655f88",
                "fields": {
                    "is_removed": false,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "last_sync_at": null,
                    "version": 1735688653315202,
                    "data_collecting_type": 2,
                    "beneficiary_group": "ce3ad1d5-3bb7-4054-80e4-71cbda16ecd6",
                    "business_area": "a07066d4-4ca6-43a7-8858-650c00bf7017",
                    "name": "Program 0",
                    "code": "hsh5",
                    "status": "ACTIVE",
                    "description": "",
                    "start_date": "2025-01-01",
                    "end_date": "2026-01-01",
                    "sector": "MULTI_PURPOSE",
                    "budget": "1000000.00",
                    "frequency_of_payments": "ONE_OFF",
                    "scope": null,
                    "partner_access": "SELECTED_PARTNERS_ACCESS",
                    "cash_plus": false,
                    "population_goal": 1000,
                    "administrative_areas_of_implementation": "",
                    "biometric_deduplication_enabled": false,
                    "collision_detector": "hope.apps.program.collision_detectors.NoopCollisionDetector",
                    "identification_key_individual_label": null,
                    "is_visible": true,
                    "household_count": 0,
                    "individual_count": 0,
                    "reconciliation_window_in_days": 0,
                    "send_reconciliation_window_expiry_notifications": false,
                    "admin_areas": [],
                    "sanction_lists": [],
                    "payment_plan_purposes": [
                        "36fccf08-a662-4535-86c5-3b5fb5b06cf2"
                    ]
                }
            },
            {
                "model": "core.datacollectingtype",
                "pk": 2,
                "fields": {
                    "created": "2025-01-01T00:00:00Z",
                    "modified": "2025-01-01T00:00:00Z",
                    "code": "dct_0",
                    "label": "DCT 0",
                    "type": "STANDARD",
                    "description": "",
                    "active": true,
                    "deprecated": false,
                    "individual_filters_available": false,
                    "household_filters_available": true,
                    "recalculate_composition": false,
                    "weight": 0,
                    "compatible_types": [
                        2
                    ],
                    "limit_to": []
                }
            },
            {
                "model": "program.beneficiarygroup",
                "pk": "ce3ad1d5-3bb7-4054-80e4-71cbda16ecd6",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "name": "Group 0",
                    "group_label": "Household",
                    "group_label_plural": "Households",
                    "member_label": "Individual",
                    "member_label_plural": "Individuals",
                    "master_detail": true
                }
            },
            {
                "model": "payment.paymentplanpurpose",
                "pk": "36fccf08-a662-4535-86c5-3b5fb5b06cf2",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "unicef_id": "PPP-19",
                    "name": "Purpose 0",
                    "description": "",
                    "limit_to": []
                }
            },
            {
                "model": "payment.paymentplangroup",
                "pk": "51268f9c-49fe-40ef-9b96-ca2da1aed792",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "unicef_id": "PPG-13",
                    "cycle": "c3077603-9987-4024-81cb-50e65722222f",
                    "name": "Default Group",
                    "delivery_import_file": null,
                    "background_action_status": null
                }
            },
            {
                "model": "account.user",
                "pk": "e5c8c87f-aac7-4ada-8050-9e83a4da29d8",
                "fields": {
                    "password": "",
                    "last_login": null,
                    "is_superuser": true,
                    "username": "user_0",
                    "first_name": "",
                    "last_name": "",
                    "is_staff": true,
                    "is_active": true,
                    "date_joined": "2025-01-01T00:00:00Z",
                    "azure_id": null,
                    "display_name": "user_0",
                    "status": "INVITED",
                    "partner": 5,
                    "email": "user_0@example.com",
                    "custom_fields": {},
                    "job_title": "",
                    "last_modify_date": "2025-01-01T00:00:00Z",
                    "groups": [],
                    "user_permissions": []
                }
            },
            {
                "model": "account.partner",
                "pk": 5,
                "fields": {
                    "name": "Partner 0",
                    "parent": null,
                    "is_un": false,
                    "lft": 1,
                    "rght": 2,
                    "tree_id": 2,
                    "level": 0,
                    "allowed_business_areas": []
                }
            }
        ]
    }
}